In [1]:
import numpy as np
import pandas as pd

## 1.	Import the attached Netflix csv file in Jupyter notebook and perform following operations using Pandas:

## a)	Print the first 5 rows and last 5 rows of the dataframe

In [40]:
df=pd.read_csv("netflix_tiles.csv")
df

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ..."
...,...,...,...,...,...,...,...,...,...,...,...
8775,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers"
8776,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies"
8777,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies"
8778,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies"
8779,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals"

In [41]:
print("first 5 rows :")
df.head()

first 5 rows :

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ..."

In [ ]:
print("last 5 rows :")
df.tail()

## b)	Check how many rows and columns are there using Pandas function.

In [ ]:
rows,columns=df.shape
print("no.of rows:",rows)
print("no.of columns:",columns)

## c)	Print all the column names.

In [ ]:
for i,col in enumerate(df.columns,start=1):
    print(f"{i}.{col}")

## d)	Calculate the descriptive statistics of all the variables(integer/float/object etc).

In [ ]:
df.describe(include="all")

## e)	Check the number of unique values for each column

In [ ]:
print("no.of unique values :\n\n",df.nunique())

## f)	Check the percentage of missing values for each column.

In [ ]:
missing_percnt=df.isnull().sum()/len(df)*100
missing_percnt

## g)	Delete all the rows where Director column has missing values.

In [ ]:
df.dropna(subset=["director"],inplace=True)
df

## h)	Print all the records where country has Germany value (including West Germany). If any other country is there along with Germany, then that row should also come in output.

In [ ]:
df=df[df["country"].str.contains("Germany",na=False)]
df

## i)	Expand Duration column into 2 separate columns – First column having the numeric value and other having String. Eg: 3 seasons should be split in 2 columns having 3 in 1st column and seasons in 2nd column.

In [ ]:
df[["Duration_num","Duration_str"]] = df['duration'].str.split(" ", n=1, expand=True)
df

## j) Split Date added into 3 separate columns having date value in 1st column, month value in 2nd column and year value in 3rd.

In [ ]:
df[["month","date_year"]]=df["date_added"].str.split(" ",n=1,expand=True)
df[["date","year"]]=df["date_year"].str.split(",",n=1,expand=True)
df=df.drop(columns="date_year")
df

## k) Print the number of TV shows/Movies released in each year.

In [42]:
count_year=df.groupby(["release_year"]).size().reset_index(name="count")
print(count_year)

    release_year  count
0           1925      1
1           1942      2
2           1943      3
3           1944      3
4           1945      4
..           ...    ...
69          2017   1030
70          2018   1141
71          2019   1024
72          2020    952
73          2021    592

[74 rows x 2 columns]

## l) Rename the column title with movie_title.

In [ ]:
df=df.rename(columns={"title":"movie_title"})
df

## m) Split Listed_in column into 3 different columns with col name (Genre1, Genre2, Genre3). Split the column based on comma.

In [ ]:
df[["Genre1","Genre2","Genre3"]]=df["listed_in"].str.split(",",n=2,expand=True)
df

## 2. Import both the attached files (student.csv and marks.csv) in Jupyter notebook and perform following operations:

In [2]:
df1=pd.read_csv("student.csv")
df1.head()

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [3]:
df2=pd.read_csv("marks.csv")
df2.head()

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

## a) Combine both the dataframes into single dataframe which will have all the records from both the tables.

In [4]:
df3=df1.merge(df2)
df3

     Student_id  Age  Gender      Grade Employed  Mark     City
0             1   19    Male  1st Class      yes    95  Chennai
1             2   20  Female  2nd Class       no    70    Delhi
2             3   18    Male  1st Class       no    98   Mumbai
3             4   21  Female  2nd Class       no    75     Pune
4             5   19    Male  1st Class       no    89    Kochi
..          ...  ...     ...        ...      ...   ...      ...
224         228   21  Female  1st Class       no    99     Pune
225         229   20    Male  2nd Class       no    70  Chennai
226         230   20    Male  3rd Class      yes    55    Delhi
227         231   19  Female  1st Class      yes    97   Mumbai
228         232   20    Male  3rd Class      yes    59     Pune

[229 rows x 7 columns]

## b) Print the maximum and minimum marks Gender wise.

In [ ]:
gen=df3.groupby("Gender")["Mark"].agg(["max","min"])
gen

## c) Print all the students IDs and their marks who have scored more than the average marks of the class.

In [10]:
avg=df3["Mark"]>df3["Mark"].mean()
df3[avg][["Student_id","Mark"]]

     Student_id  Mark
0             1    95
2             3    98
3             4    75
4             5    89
9            12    90
..          ...   ...
218         222    74
219         223    79
221         225    72
224         228    99
227         231    97

[137 rows x 2 columns]

In [12]:
df3["Mark"].mean()

71.38864628820961

## d) Print the dataframe who are Males and are Employed.

In [23]:
df4=df3[df3["Gender"]=="Male"][df3["Employed"]=="yes"]
df4

C:\Users\Dell\AppData\Local\Temp\ipykernel_20756\1491705362.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df4=df3[df3["Gender"]=="Male"][df3["Employed"]=="yes"]

     Student_id  Age Gender      Grade Employed  Mark     City
0             1   19   Male  1st Class      yes    95  Chennai
5             6   20   Male  2nd Class      yes    69  Gwalior
7             8   21   Male  3rd Class      yes    54  Chennai
10           13   19   Male  1st Class      yes    92  Gwalior
12           15   19   Male  1st Class      yes    97     Pune
14           17   20   Male  2nd Class      yes    68  Gwalior
16           19   21   Male  2nd Class      yes    72  Chennai
27           30   19   Male  1st Class      yes    81  Chennai
32           35   20   Male  2nd Class      yes    79  Gwalior
34           37   21   Male  3rd Class      yes    53     Pune
39           42   19   Male  1st Class      yes    86    Delhi
41           44   19   Male  1st Class      yes    95     Pune
43           46   20   Male  2nd Class      yes    79    Delhi
45           48   21   Male  2nd Class      yes    67     Pune
55           59   19   Male  1st Class      yes    89     Pune
60           64   20   Male  2nd Class      yes    78    Delhi
62           66   21   Male  3rd Class      yes    59     Pune
67           71   19   Male  1st Class      yes    85    Kochi
69           73   19   Male  1st Class      yes    89   Bhopal
71           75   20   Male  2nd Class      yes    79    Delhi
73           77   21   Male  2nd Class      yes    77     Pune
84           88   19   Male  1st Class      yes    96     Pune
89           93   20   Male  2nd Class      yes    74    Kochi
91           95   21   Male  3rd Class      yes    50   Bhopal
96          100   19   Male  1st Class      yes    84    Kochi
98          102   19   Male  1st Class      yes    98  Chennai
100         104   20   Male  2nd Class      yes    78   Mumbai
102         106   21   Male  2nd Class      yes    77    Kochi
113         117   19   Male  1st Class      yes    90    Kochi
118         122   20   Male  2nd Class      yes    75   Mumbai
120         124   21   Male  3rd Class      yes    49  Chennai
125         129   19   Male  1st Class      yes    89  Gwalior
127         131   19   Male  1st Class      yes    90  Chennai
129         133   20   Male  2nd Class      yes    75   Mumbai
131         135   21   Male  2nd Class      yes    75    Kochi
142         146   19   Male  1st Class      yes    98   Mumbai
147         151   20   Male  2nd Class      yes    78     Pune
149         153   21   Male  3rd Class      yes    46  Gwalior
154         158   19   Male  1st Class      yes    92     Pune
156         160   19   Male  1st Class      yes    92    Delhi
158         162   20   Male  2nd Class      yes    79     Pune
160         164   21   Male  2nd Class      yes    75  Gwalior
171         175   19   Male  1st Class      yes    84     Pune
176         180   20   Male  2nd Class      yes    76    Delhi
178         182   21   Male  3rd Class      yes    58     Pune
183         187   19   Male  1st Class      yes    83    Kochi
185         189   19   Male  1st Class      yes    89   Bhopal
187         191   20   Male  2nd Class      yes    77    Delhi
189         193   21   Male  2nd Class      yes    75     Pune
200         204   19   Male  1st Class      yes    91     Pune
205         209   20   Male  2nd Class      yes    70   Mumbai
207         211   21   Male  3rd Class      yes    58    Kochi
212         216   19   Male  1st Class      yes    95   Mumbai
214         218   19   Male  1st Class      yes    96    Kochi
216         220   20   Male  2nd Class      yes    75   Bhopal
218         222   21   Male  2nd Class      yes    74    Kochi
226         230   20   Male  3rd Class      yes    55    Delhi
228         232   20   Male  3rd Class      yes    59     Pune

## e)Create a new Column ‘IQ_level’ which will have 3 values (Intelligent, Mediocre, weak). If student scored than 80 then Tag him as Intelligent, if student scored between 50-80, then Mediocre, else weak.

In [31]:
def iq(value):
    if value>80:
        return "Intelligent"

    elif 80>value>50:
        return "Mediocre"

    else :
        return "weak"

df3["IQ_level"]=df3["Mark"].apply(iq)
df3

     Student_id  Age  Gender      Grade Employed  Mark     City     IQ_level
0             1   19    Male  1st Class      yes    95  Chennai  Intelligent
1             2   20  Female  2nd Class       no    70    Delhi     Mediocre
2             3   18    Male  1st Class       no    98   Mumbai  Intelligent
3             4   21  Female  2nd Class       no    75     Pune     Mediocre
4             5   19    Male  1st Class       no    89    Kochi  Intelligent
..          ...  ...     ...        ...      ...   ...      ...          ...
224         228   21  Female  1st Class       no    99     Pune  Intelligent
225         229   20    Male  2nd Class       no    70  Chennai     Mediocre
226         230   20    Male  3rd Class      yes    55    Delhi     Mediocre
227         231   19  Female  1st Class      yes    97   Mumbai  Intelligent
228         232   20    Male  3rd Class      yes    59     Pune     Mediocre

[229 rows x 8 columns]

## f) Count the number of males and females from each city.

In [50]:
a=df3.groupby(["Gender","City"]).size().reset_index(name="count")
a

    Gender     City  count
0   Female   Bhopal     13
1   Female  Chennai     15
2   Female    Delhi     12
3   Female  Gwalior     14
4   Female    Kochi     10
5   Female   Mumbai     16
6   Female     Pune     15
7     Male   Bhopal     15
8     Male  Chennai     18
9     Male    Delhi     20
10    Male  Gwalior     18
11    Male    Kochi     21
12    Male   Mumbai     16
13    Male     Pune     26

## g) Print the top 5 Male scorers.

In [66]:
df4=df3[df3["Gender"]=="Male"]
df4.sort_values("Mark",ascending=False).head()

     Student_id  Age Gender      Grade Employed  Mark     City     IQ_level
146         150   19   Male  1st Class       no   100   Bhopal  Intelligent
144         148   18   Male  1st Class       no    99    Kochi  Intelligent
57           61   18   Male  1st Class       no    98  Gwalior  Intelligent
59           63   19   Male  1st Class       no    98  Chennai  Intelligent
98          102   19   Male  1st Class      yes    98  Chennai  Intelligent

## h) Replace the Male value with M and Female value with F and export this dataframe to excel file in D: (D drive) and name the file as test.csv.

In [81]:
df3["Gender"]=df3["Gender"].replace(["Male","Female"],["M","F"])
df3.to_csv(r"D:/test.csv",index=False)

## i) Check if any student_ID is duplicated.

In [98]:
dup=df3[df3["Student_id"].duplicated()]
dup

Empty DataFrame
Columns: [Student_id, Age, Gender, Grade, Employed, Mark, City, IQ_level]
Index: []

In [99]:
# There is no data in "dup" because there are no duplicates in Student_id

## j) Create a separate dataframe which will have all the Integer/Float variables.

In [102]:
var==df3.select_dtypes(include="number")
var

     Student_id  Age  Mark
0             1   19    95
1             2   20    70
2             3   18    98
3             4   21    75
4             5   19    89
..          ...  ...   ...
224         228   21    99
225         229   20    70
226         230   20    55
227         231   19    97
228         232   20    59

[229 rows x 3 columns]

## k) Get those Student_IDs which are present in Students table but not in Marks table.

In [111]:
df3[~df3["Student_id"].isin(df3["Mark"])]

     Student_id  Age Gender      Grade Employed  Mark     City     IQ_level
0             1   19      M  1st Class      yes    95  Chennai  Intelligent
1             2   20      F  2nd Class       no    70    Delhi     Mediocre
2             3   18      M  1st Class       no    98   Mumbai  Intelligent
3             4   21      F  2nd Class       no    75     Pune     Mediocre
4             5   19      M  1st Class       no    89    Kochi  Intelligent
..          ...  ...    ...        ...      ...   ...      ...          ...
224         228   21      F  1st Class       no    99     Pune  Intelligent
225         229   20      M  2nd Class       no    70  Chennai     Mediocre
226         230   20      M  3rd Class      yes    55    Delhi     Mediocre
227         231   19      F  1st Class      yes    97   Mumbai  Intelligent
228         232   20      M  3rd Class      yes    59     Pune     Mediocre

[174 rows x 8 columns]

## 3.Explain the concept of missing values. How can you identify the missing values in a Pandas DataFrame ? What are the different ways of treating/Imputing/Deleting the missing values.Explain with example.

In [1]:
"""
CONCEPT OF MISSING VALUES:

Missing values are the data that is not stored or recorded for some reason.
In pandas, missing values are usually represented as:
(a)NaN (Not a Number) — used for numeric data.
(b)None — used for object (string) data, but internally often converted to NaN.


Causes of missing values:

(a)Data entry mistakes.
(b)Incomplete surveys or forms.
(c)Mismatched joins/merges between tables.
(d)Data corruption.
"""

'\nCONCEPT OF MISSING VALUES:\n\nMissing values are the data that is not stored or recorded for some reason.\nIn pandas, missing values are usually represented as:\n(a)NaN (Not a Number) — used for numeric data.\n(b)None — used for object (string) data, but internally often converted to NaN.\n\n'

In [3]:
"""
IDENTIFING MISSING VALUES IN PANDAS:
"""
import numpy as np
import pandas as pd

df=pd.DataFrame({
    "Name": ["A", "B", None, "D"],
    "Age": [25, np.nan, 30, 22],
    "City": ["Delhi", None, "Mumbai", "Kochi"]
})
df

   Name   Age    City
0     A  25.0   Delhi
1     B   NaN    None
2  None  30.0  Mumbai
3     D  22.0   Kochi

In [6]:
#To find the missing values:
df.isnull()        # True where values are missing
df.notnull()       # True where values are present
df.isnull().sum()  # Count missing values per column
df.isnull().sum().sum()  # Total missing values in entire DataFrame

Name    1
Age     1
City    1
dtype: int64

In [7]:
"""
TREATING AND IMPORTING MISSING VALUES:

There are 3 different strategies:

A) Deleting Missing Values
When missing data is small and can be removed without losing important information.

"""
df.dropna()         # Remove rows with any missing value
df.dropna(axis=1)   # Remove entire columns with missing values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
"""
B) Imputing / Filling Missing Values
When you can replace missing values with some meaningful substitute.

"""

df.fillna(0)  # Fill with a constant

df["Age"].fillna(df["Age"].mean(), inplace=True) # Fill with column mean (numeric data)

df["Age"].fillna(df["Age"].median(), inplace=True) # Fill with column median (numeric data)

df["City"].fillna(df["City"].mode()[0], inplace=True) # Fill with mode (most frequent value, works for strings too)

df.fillna(method="ffill") # Forward fill (propagate last valid value forward)

df.fillna(method="bfill") # Backward fill (propagate next valid value backward)